projects/projects.org
#+title: Course Project 
#+include: "../setup.org" 

* Why a Project?
The IOOPM project serves several goals, but mainly, it serves as
an introduction to the inherent problems of software development.
So far on the course, and in previous courses like PKD, we have
focussed on /programming/, in the sense of "cutting code". Our main
problems have been getting things to run, figthing compilers and
libraries, chasing double deallocations or memory leaks, or
understanding why a particular method call did not get dispatched
in a way we intended. These are /problems in the small/[fn::By
which I do not mean that they are small problems!] -- now it is
time to face problems in the large[fn::Admittedly, for a quite
small large.].

The main challenge of software development is /not/ programming --
it is understanding specification, communicating with other
members of the team, customers and problem owners, dealing with
design decisions of the past that turned out not to be as future
proof as intended, estimating time, fighting motivational issues,
and delivering on time and on budget with acceptable quality, not
just once, but consistently. This is, as it turns out, quite a
tall order.

While the domain of the projects was picked to serve a learning
purpose, the main goal of the project is *not* to learn more
programming, but to put programming to work in a larger context,
and deliver in a way that is sustainable[fn::Sustainable includes
that you are supposed to work in a way that is reasonable to
expect of you without destroying you if you were to do it for a
couple of years.].

What this means is that during the project you should be thinking
consistently about these things:

- How can we as a team be reasonably sure to deliver what we set
  out to deliver at a date we committed to?
- How can we load-balance the workload so that no one is
  overwhelmed?
- How can we be sure that we are delivering the right thing?
- How do we make sure that the thing we are delivering works
  correctly?
- How do we communicate effectively in the team?
- How do we deal effectively with team members that are
  demotivated, angry, stressed about things outside of the
  project, in a way that is sustainable?
- How do we ensure that the team is working smoothly? (E.g.,
  making sure that the team is a team, that people are not working
  against each others, that no small cabals are formed, etc.)

And more personally about:

- How do I function in a team? Where are my strengths and weaknesses?
- How should I try to adapt the way I work to work better in a team?
- What motivates me? What demotivates me? How do I stay motivated in a project?
- How good am I at estimating how long a task will take? What is the process
  that produce my estimations?
- What role do I want to play in a team?

Because the goal of the project is to understand and reflect on
the software development process, the main requirement for passing
and failing is not whether you manage to complete the project or
not. **What I request is that you all do your best effort to
complete the project, in a sustainable way, and without chucking
all the principles of good software development just to be able to
demo something at the end.**

In practise that means that if you are able to hand something in
that only implements a subset of the requested functionality, but
that is solid enough for others to build on, you are probably not
going to fail. However, this should not come as a surprise to your
coach[fn::The role of the coach will be described below.]! You
must efficiently communicate with your coach so that he or she
knows what to expect from your final deliverable, or we will
expect that you have completed the entire specification.

In the likely event that you think anything about the project
specification is vague, know that it is your responsibility to
untangle it. This includes details in the specification as well
as requirements to pass this part of the course. Also, in either
case, you cannot rely on getting answers that satisfy you.

* Process
** How to work
This is impossible to describe, but here are some suggestions:
- Work in sprints, ideally more than two
- No coding in the first day and last two days of the project
- Doing a bad job of dividing tasks will hurt the project
- Don't be afraid to revise plans/tasks/alottment/etc.
- Take 5 minutes to sync daily, even of workdays where you only work on other things (like other courses)
- Spend time on "group norming and forming" -- have a kick-off, celebrate your wins (and your losses)
- Avoid making this mistake: "I'm not a coder so I better work on something that does not involve programming"
- Don't panic!
- Don't go dark -- keep your coach informed about progress
- If you don't understand X[fn::Where X can be stack traversal,
  pull requests or Scrum, or...], create a task force of 1--2
  people to learn about X and educate the others
- When setting goals, try hard to make the goals measurable (how else will you know if you have met them?)
- Risk taking is less risky when combined with time-boxing
- Strong opinions does not make one right
- Don't buy a single person's whole design -- share ownership of ideas, decision power, etc.
- Assigning roles and responsibilities is a really good idea, but
  such things only work if everyone in the team cooperates and e.g. gives the project manager more power
- Don't lie about your abilities
- Don't lie about (lack of) progress
- If you mess up -- don't try to cover it up! For example, if you
  forget to record time measurements -- don't fudge them
  afterwards because you are supposed to. What will you learn from
  that?
- If you see a team member struggling without speaking up, help that person come clean
- Any process is better than no process

