projects/projects.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-02 tor 00:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Course Project</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tobias Wrigstad" />
<link rel="stylesheet" type="text/css" href="/home/stw/t/ioopm/2018/site/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/home/stw/t/ioopm/2018/site/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Course Project</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org632d309">1. Why a Project?</a></li>
<li><a href="#orge96761d">2. Process</a>
<ul>
<li><a href="#org3694ac8">2.1. How to work</a></li>
<li><a href="#orgce46b57">2.2. How Not To Work</a></li>
</ul>
</li>
<li><a href="#orga1d153a">3. Project Infrastructure and Constraints</a>
<ul>
<li><a href="#orgace4899">3.1. Time: Lower bound, upper bound</a></li>
<li><a href="#org0c613fd">3.2. Resources: The Team</a></li>
<li><a href="#orgc1cfa0f">3.3. Resources: The Coach</a></li>
<li><a href="#orgf63137c">3.4. Failing to Hand In Something Remotely Satisfactory</a></li>
<li><a href="#org334f1de">3.5. Failing to Hand in Something Satisfactory</a></li>
</ul>
</li>
<li><a href="#org0709e00">4. What to Hand In</a>
<ul>
<li><a href="#orgbe8b059">4.1. The Code</a></li>
<li><a href="#org52baa2e">4.2. The Tests</a></li>
<li><a href="#org339028e">4.3. Integrations with Existing Code</a></li>
<li><a href="#orgba2f41a">4.4. Design Documentation</a></li>
<li><a href="#org5d6e090">4.5. Team Retrospective</a></li>
<li><a href="#orgbcc8f14">4.6. Individual Reflection</a></li>
<li><a href="#org11bfcb7">4.7. Test Report</a></li>
<li><a href="#org920b5f6">4.8. Code Quality Report</a></li>
<li><a href="#org073f4ed">4.9. Deviations</a></li>
</ul>
</li>
<li><a href="#org827af9d">5. Process Requirements</a>
<ul>
<li><a href="#org026165c">5.1. Trello (or similar)</a></li>
<li><a href="#orga0b8758">5.2. GitHub for Version Control, Issue Tracking and Pull Requests</a></li>
<li><a href="#orgd5d62a6">5.3. Tools for Making Good Code</a></li>
</ul>
</li>
<li><a href="#orga20e0c5">6. Final Seminar</a>
<ul>
<li><a href="#org7ea3f5e">6.1. Do we need slides?</a></li>
</ul>
</li>
<li><a href="#org6ffef03">7. Nutshell Summaries of the two Projects</a>
<ul>
<li><a href="#org9831b30">7.1. Project One</a></li>
<li><a href="#org3459500">7.2. Project Two</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org632d309" class="outline-2">
<h2 id="org632d309"><span class="section-number-2">1</span> Why a Project?</h2>
<div class="outline-text-2" id="text-1">
<p>
The IOOPM project serves several goals, but mainly, it serves as
an introduction to the inherent problems of software development.
So far on the course, and in previous courses like PKD, we have
focussed on <i>programming</i>, in the sense of "cutting code". Our main
problems have been getting things to run, figthing compilers and
libraries, chasing double deallocations or memory leaks, or
understanding why a particular method call did not get dispatched
in a way we intended. These are <i>problems in the small</i><sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> &#x2013; now it is
time to face problems in the large<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>.
</p>

<p>
The main challenge of software development is <i>not</i> programming &#x2013;
it is understanding specification, communicating with other
members of the team, customers and problem owners, dealing with
design decisions of the past that turned out not to be as future
proof as intended, estimating time, fighting motivational issues,
and delivering on time and on budget with acceptable quality, not
just once, but consistently. This is, as it turns out, quite a
tall order.
</p>

<p>
While the domain of the projects was picked to serve a learning
purpose, the main goal of the project is <b>not</b> to learn more
programming, but to put programming to work in a larger context,
and deliver in a way that is sustainable<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>.
</p>

<p>
What this means is that during the project you should be thinking
consistently about these things:
</p>

<ul class="org-ul">
<li>How can we as a team be reasonably sure to deliver what we set
out to deliver at a date we committed to?</li>
<li>How can we load-balance the workload so that no one is
overwhelmed?</li>
<li>How can we be sure that we are delivering the right thing?</li>
<li>How do we make sure that the thing we are delivering works
correctly?</li>
<li>How do we communicate effectively in the team?</li>
<li>How do we deal effectively with team members that are
demotivated, angry, stressed about things outside of the
project, in a way that is sustainable?</li>
<li>How do we ensure that the team is working smoothly? (E.g.,
making sure that the team is a team, that people are not working
against each others, that no small cabals are formed, etc.)</li>
</ul>

<p>
And more personally about:
</p>

<ul class="org-ul">
<li>How do I function in a team? Where are my strengths and weaknesses?</li>
<li>How should I try to adapt the way I work to work better in a team?</li>
<li>What motivates me? What demotivates me? How do I stay motivated in a project?</li>
<li>How good am I at estimating how long a task will take? What is the process
that produce my estimations?</li>
<li>What role do I want to play in a team?</li>
</ul>

<p>
Because the goal of the project is to understand and reflect on
the software development process, the main requirement for passing
and failing is not whether you manage to complete the project or
not. **What I request is that you all do your best effort to
complete the project, in a sustainable way, and without chucking
all the principles of good software development just to be able to
demo something at the end.**
</p>

<p>
In practise that means that if you are able to hand something in
that only implements a subset of the requested functionality, but
that is solid enough for others to build on, you are probably not
going to fail. However, this should not come as a surprise to your
coach<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>! You
must efficiently communicate with your coach so that he or she
knows what to expect from your final deliverable, or we will
expect that you have completed the entire specification.
</p>

<p>
In the likely event that you think anything about the project
specification is vague, know that it is your responsibility to
untangle it. This includes details in the specification as well
as requirements to pass this part of the course. Also, in either
case, you cannot rely on getting answers that satisfy you.
</p>
</div>
</div>

<div id="outline-container-orge96761d" class="outline-2">
<h2 id="orge96761d"><span class="section-number-2">2</span> Process</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3694ac8" class="outline-3">
<h3 id="org3694ac8"><span class="section-number-3">2.1</span> How to work</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This is impossible to describe, but here are some suggestions:
</p>
<ul class="org-ul">
<li>Work in sprints, ideally more than two</li>
<li>No coding in the first day and last two days of the project</li>
<li>Doing a bad job of dividing tasks will hurt the project</li>
<li>Don't be afraid to revise plans/tasks/alottment/etc.</li>
<li>Take 5 minutes to sync daily, even of workdays where you only work on other things (like other courses)</li>
<li>Spend time on "group norming and forming" &#x2013; have a kick-off, celebrate your wins (and your losses)</li>
<li>Avoid making this mistake: "I'm not a coder so I better work on something that does not involve programming"</li>
<li>Don't panic!</li>
<li>Don't go dark &#x2013; keep your coach informed about progress</li>
<li>If you don't understand X<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>, create a task force of 1&#x2013;2
people to learn about X and educate the others</li>
<li>When setting goals, try hard to make the goals measurable (how else will you know if you have met them?)</li>
<li>Risk taking is less risky when combined with time-boxing</li>
<li>Strong opinions does not make one right</li>
<li>Don't buy a single person's whole design &#x2013; share ownership of ideas, decision power, etc.</li>
<li>Assigning roles and responsibilities is a really good idea, but
such things only work if everyone in the team cooperates and e.g. gives the project manager more power</li>
<li>Don't lie about your abilities</li>
<li>Don't lie about (lack of) progress</li>
<li>If you mess up &#x2013; don't try to cover it up! For example, if you
forget to record time measurements &#x2013; don't fudge them
afterwards because you are supposed to. What will you learn from
that?</li>
<li>If you see a team member struggling without speaking up, help that person come clean</li>
<li>Any process is better than no process</li>
</ul>
</div>
</div>
