projects/projects.org
** How Not To Work
Historically on this course, there has been a tendency to focus on
optimisations, and following specifications to the letter from the
start. **This is a really bad idea.** As has been regurgitated since
day one on this course, don't over-engineer your designs and
implementations from the start as you simply do not have enough
information or understanding of the problem at that point.

Example: it used to be the case that the project description was
phrased in terms of, "implement /X/, here is how to do it by
bit-manipulation to save memory." /This was purposely a setup!/
The right way to go about this is to first do /X/ in the simplest
possible way. That allows testing, integration, etc. and
benchmarking how much memory would actually be saved using the
bit-manipulation implementation! Lots of student groups got stuck
on trying to both understand /X/ and the bit-manipulation /at the
same time/, causing the entire project to be delayed or at times
even fail because without /X/, the it was impossible to get anything
else working[fn::One could successfully argue that this is a
testament to my failure as a lecturer to hammer in the importance
of getting something working before optimising. One could also
successfully argue that students follow specifications too
slavishly. One could also argue that optimisations have a certain
attraction to some people. Etc.].

Planning is hard and cannot be learned from a book! If your
approach is to work as hard as possible from the start and then
harder (or less hard) when you get closer to the deadline, you are
not doing it right. Unless you have a plan, you cannot deviate,
and you'll have a hard time communicating to us what our
expectations should be of your team's final deliverable. Start by
making a plan, and see how it goes. Maybe you will learn that you
have a tendency to think that things are simpler than they are. Or
that you have a tendency to not realise that physical meetings
take time, or that it may be hard to get 20 solid hours of coding
done in a 40 hour week! Having expectations and refining them are
key. Flying blind is not.

This course is not about teaching you the right way to develop
software in teams, but about giving you an understanding of the
importance of the whole field of software engineering. Later
courses will give you better tools and techniques, but unless you
reflect on things now[fn::Meaning, your focus is on the finished
product, not on the actual project.], you'll get less out of those
courses later!

* Project Infrastructure and Constraints
** Time: Lower bound, upper bound

The project may start at December 4th, but not earlier. The
project will be handed in no later than 24 hours /before/ the
seminar. For example, if your team's seminar is on the 11th of
January at 15:00, the strict deadline is January 10th, at 15:00.
*This is a strict deadline which may not be renegotiated.*
The time slots for the seminars will be announced on the course
web site or Piazza in December.

We expect that you take some time off during Christmas and New
Year. The definition of /some time/ is up to you. For example, in
2017, there are exactly four holidays (December 25 and 26, 1st and
5th of January), in addition to weekends. Feel free to handle this
in whatever way you want, as long as you get the work done.

In the past, I have had several panic calls from project members
who feel that most of the team is AWOL and does not care during
the holidays, and feel obligated to work around the clock to move
things forward. This causes tension in the team, is bad for
quality, and simply serves to perpetuate an already bad situation.
/As a team, you are responsible for making sure this does not
happen./ Take responsibility for the well-being of your fellow
team members.

You are invited to reach out to me as often as you need during
Christmas and New Year. I might be travelling, but working.


** Resources: The Team

Each team will be about 6 people. You may choose to work however
you like in this team. You may use pair programming, or not. You
may choose to only work together, all at the same time at the
University, or completely distributed, or a mix.

Since team members have signed up for the project, this means they
have also signed the statement of intent, promising to pull their
weight. Any team member that falls back on this promise can be
"voted of the Island". Talk to Tobias if the need arises.


** Resources: The Coach

Varje team får en coach tilldelad sig, för att få hjälp och svara
på frågor. Dessa anslås på kursens webbsida/Piazza i samband med
grupperna. Tidigt under projektets gång bör teamet ha ett möte med
coachen. Vid detta första möte skall teamet presentera sin tänkta
(partiella?) högnivådesign för coachen, samt sin planering, d.v.s.
hur systemet är uppdelat i delsystem, gränssnittet mellan
delsystemen, hur delsystemen är fördelade över programmeringspar,
och några första grova deadlines.

Teamet ansvarar för att boka ett avstämningsmöte med sin coach
någon gång under projektets gång. Vid detta möte skall teamet kort
rapportera om hur arbetet fortskrider, om man räknar med att bli
klar i tid, eventuella stora problem, etc. Vid behov kan
ytterligare möten bokas. **Vid problem skall man i första hand kontakta sin coach.**


** Failing to Hand In Something Remotely Satisfactory

A team that fails to hand anything in that is remotely
satisfactory will be failed. Each team member will be given a new
opportunity next year, as part of a different team.

** Failing to Hand in Something Satisfactory

A team that fails to hand anything in that is satisfactory will be
given an opportunity to fix their problems. We will negotiate a
new deadline, negotiate demands of the final deliverable, and go
from there.

Notably, satisfaction is tied to expectations. This means
surprising your coach (and other examiners) by handing in
something very poor is a harder fail than an expected, equally
poor delivery.

* What to Hand In
The entire hand-in should be contained in the team's GitHub
repository. The repository should have the following structure
(see below for additional explaination):

#+BEGIN_SRC
.
├── demo/
├── doc/
│   └── design.md # note markdown format
├── makefile # top-level makefile
├── proj/
│   ├── code_quality_report.md
│   ├── deviations.md
│   ├── individual_reflection.md
│   ├── team_reflection.md
│   └── test_report.md
├── src/
└── test/
#+END_SRC
** The Code

The code (excluding demo code and tests) should be placed in
=./src= in the repo. You can have whatever structure under this
directory. It should be possible to build the code using the
top-level make file[fn::By top-level make file is meant a make
file at the top-level, that is the root of the directory
structure. Feel free to have many makefiles for building things,
and use them in the top-level makefile to accomplish its work.].

Note that files with extension .md are supposed to use [[https://daringfireball.net/projects/markdown/syntax][markdown
format]].

