projects/projects.html

<div id="outline-container-orgce46b57" class="outline-3">
<h3 id="orgce46b57"><span class="section-number-3">2.2</span> How Not To Work</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Historically on this course, there has been a tendency to focus on
optimisations, and following specifications to the letter from the
start. <b><b>This is a really bad idea.</b></b> As has been regurgitated since
day one on this course, don't over-engineer your designs and
implementations from the start as you simply do not have enough
information or understanding of the problem at that point.
</p>

<p>
Example: it used to be the case that the project description was
phrased in terms of, "implement <i>X</i>, here is how to do it by
bit-manipulation to save memory." <i>This was purposely a setup!</i>
The right way to go about this is to first do <i>X</i> in the simplest
possible way. That allows testing, integration, etc. and
benchmarking how much memory would actually be saved using the
bit-manipulation implementation! Lots of student groups got stuck
on trying to both understand <i>X</i> and the bit-manipulation <i>at the
same time</i>, causing the entire project to be delayed or at times
even fail because without <i>X</i>, the it was impossible to get anything
else working<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup>.
</p>

<p>
Planning is hard and cannot be learned from a book! If your
approach is to work as hard as possible from the start and then
harder (or less hard) when you get closer to the deadline, you are
not doing it right. Unless you have a plan, you cannot deviate,
and you'll have a hard time communicating to us what our
expectations should be of your team's final deliverable. Start by
making a plan, and see how it goes. Maybe you will learn that you
have a tendency to think that things are simpler than they are. Or
that you have a tendency to not realise that physical meetings
take time, or that it may be hard to get 20 solid hours of coding
done in a 40 hour week! Having expectations and refining them are
key. Flying blind is not.
</p>

<p>
This course is not about teaching you the right way to develop
software in teams, but about giving you an understanding of the
importance of the whole field of software engineering. Later
courses will give you better tools and techniques, but unless you
reflect on things now<sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup>, you'll get less out of those
courses later!
</p>
</div>
</div>
</div>

<div id="outline-container-orga1d153a" class="outline-2">
<h2 id="orga1d153a"><span class="section-number-2">3</span> Project Infrastructure and Constraints</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgace4899" class="outline-3">
<h3 id="orgace4899"><span class="section-number-3">3.1</span> Time: Lower bound, upper bound</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The project may start at December 4th, but not earlier. The
project will be handed in no later than 24 hours <i>before</i> the
seminar. For example, if your team's seminar is on the 11th of
January at 15:00, the strict deadline is January 10th, at 15:00.
<b>This is a strict deadline which may not be renegotiated.</b>
The time slots for the seminars will be announced on the course
web site or Piazza in December.
</p>

<p>
We expect that you take some time off during Christmas and New
Year. The definition of <i>some time</i> is up to you. For example, in
2017, there are exactly four holidays (December 25 and 26, 1st and
5th of January), in addition to weekends. Feel free to handle this
in whatever way you want, as long as you get the work done.
</p>

<p>
In the past, I have had several panic calls from project members
who feel that most of the team is AWOL and does not care during
the holidays, and feel obligated to work around the clock to move
things forward. This causes tension in the team, is bad for
quality, and simply serves to perpetuate an already bad situation.
<i>As a team, you are responsible for making sure this does not
happen.</i> Take responsibility for the well-being of your fellow
team members.
</p>

<p>
You are invited to reach out to me as often as you need during
Christmas and New Year. I might be travelling, but working.
</p>
</div>
</div>


<div id="outline-container-org0c613fd" class="outline-3">
<h3 id="org0c613fd"><span class="section-number-3">3.2</span> Resources: The Team</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Each team will be about 6 people. You may choose to work however
you like in this team. You may use pair programming, or not. You
may choose to only work together, all at the same time at the
University, or completely distributed, or a mix.
</p>

<p>
Since team members have signed up for the project, this means they
have also signed the statement of intent, promising to pull their
weight. Any team member that falls back on this promise can be
"voted of the Island". Talk to Tobias if the need arises.
</p>
</div>
</div>


<div id="outline-container-orgc1cfa0f" class="outline-3">
<h3 id="orgc1cfa0f"><span class="section-number-3">3.3</span> Resources: The Coach</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Varje team får en coach tilldelad sig, för att få hjälp och svara
på frågor. Dessa anslås på kursens webbsida/Piazza i samband med
grupperna. Tidigt under projektets gång bör teamet ha ett möte med
coachen. Vid detta första möte skall teamet presentera sin tänkta
(partiella?) högnivådesign för coachen, samt sin planering, d.v.s.
hur systemet är uppdelat i delsystem, gränssnittet mellan
delsystemen, hur delsystemen är fördelade över programmeringspar,
och några första grova deadlines.
</p>

<p>
Teamet ansvarar för att boka ett avstämningsmöte med sin coach
någon gång under projektets gång. Vid detta möte skall teamet kort
rapportera om hur arbetet fortskrider, om man räknar med att bli
klar i tid, eventuella stora problem, etc. Vid behov kan
ytterligare möten bokas. <b><b>Vid problem skall man i första hand kontakta sin coach.</b></b>
</p>
</div>
</div>


<div id="outline-container-orgf63137c" class="outline-3">
<h3 id="orgf63137c"><span class="section-number-3">3.4</span> Failing to Hand In Something Remotely Satisfactory</h3>
<div class="outline-text-3" id="text-3-4">
<p>
A team that fails to hand anything in that is remotely
satisfactory will be failed. Each team member will be given a new
opportunity next year, as part of a different team.
</p>
</div>
</div>

<div id="outline-container-org334f1de" class="outline-3">
<h3 id="org334f1de"><span class="section-number-3">3.5</span> Failing to Hand in Something Satisfactory</h3>
<div class="outline-text-3" id="text-3-5">
<p>
A team that fails to hand anything in that is satisfactory will be
given an opportunity to fix their problems. We will negotiate a
new deadline, negotiate demands of the final deliverable, and go
from there.
</p>

<p>
Notably, satisfaction is tied to expectations. This means
surprising your coach (and other examiners) by handing in
something very poor is a harder fail than an expected, equally
poor delivery.
</p>
</div>
</div>
</div>

<div id="outline-container-org0709e00" class="outline-2">
<h2 id="org0709e00"><span class="section-number-2">4</span> What to Hand In</h2>
<div class="outline-text-2" id="text-4">
<p>
The entire hand-in should be contained in the team's GitHub
repository. The repository should have the following structure
(see below for additional explaination):
</p>

<pre class="example">
.
├── demo/
├── doc/
│   └── design.md # note markdown format
├── makefile # top-level makefile
├── proj/
│   ├── code_quality_report.md
│   ├── deviations.md
│   ├── individual_reflection.md
│   ├── team_reflection.md
│   └── test_report.md
├── src/
└── test/
</pre>
</div>
<div id="outline-container-orgbe8b059" class="outline-3">
<h3 id="orgbe8b059"><span class="section-number-3">4.1</span> The Code</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The code (excluding demo code and tests) should be placed in
<code>./src</code> in the repo. You can have whatever structure under this
directory. It should be possible to build the code using the
top-level make file<sup><a id="fnr.8" class="footref" href="#fn.8">8</a></sup>.
</p>

<p>
Note that files with extension .md are supposed to use <a href="https://daringfireball.net/projects/markdown/syntax">markdown
format</a>.
</p>
</div>
</div>
