projects/projects.org
** The Tests

Unit tests, integration tests, etc. are placed in =./test=. It
should be possible to run these with =make test= and =make memtest= with the top-level makefile.

** Integrations with Existing Code

Both projects ask for integration with existing code. Such code
should be placed in =./demo=. The top-level makefile should allow
building this code and link it with the code in =./src=.

** Design Documentation

In the file =./doc/design.md=, describe the design of the system at
a high level. You must start with a high-level description using
some graphical notation and accompanying text. The purpose of this
document is to serve as a starting point for someone that wants to
understand the implementation.

This file, together with =./proj/deviations.md= (and, naturally the
code) will be used by the examiner to convince him/herself that
you pass Y68.


** Team Retrospective

In a relatively short text write a team retrospective in which you
reflect on how the team has worked together. **A report template
[[file:project-report.org][is found here]].** Using this template, you will be asked to reflect
on the questions listed at the top of this document, but also
about:

- The communication between team members and with people outside the team
- The cooperation between team members
- The coordination between team members with respect to technical tasks
- How the programming tasks were divided, distributed, carried
  out, load-balanced, etc. -- if you used pair programming how did
  that go? Did you use it for everything?
- How did you go about planning? Were your plans mostly followed?
- How did decision making happen?
- What process did you follow, why and how did that go?
- What are they key lessons learned? (Both negative and positive!)

In a separate section of this document, diskutera arbetet med pull
requests (PRs) och löpande granskning av kod som går in i
''master''. Vad ledde detta till? Var det endast merarbete eller
tjänade det något till? Hur fungerade färgglada diffar på GitHub
som stöd för att se vad som ändrats? Hur ofta knuffades en PR
tillbaka för förändringar (eller liknande) innan den fick
merge:as? Hur många PR gjordes? Låg de länge i snitt? Arbetade
alla par lika med PR? Vad fungerade? Vad fungerade inte?

Sammanställ också samtliga gruppmedlemmars tidsloggar och ta fram
en gemensam sammanställning av tidsåtgång och fördelning över
olika kategorier[fn::The categories should include at least
design, documentation, meetings, implementation, review of pull
requests, and testing. Testing should not include unit testing,
but integration testing and regression testing.]. Denna skall
visualiseras som ett pie chart.

The team retrospective goes into a file in =proj= called
=team_reflection.md=.

This file should convince the examiner that you pass Y64.
The text on pull requests, together with the actual pull request
log on GitHub, should convince the examiner that you pass Y66.

** Individual Reflection
Varje projektmedlem skall skriva en kort självreflektion[fn::About
1000--1500 characters. Note -- all character counts in this
document are to be interpreted as "as outputted by the ~wc~ command".] om sin
prestation. Vilka är dina styrkor och svagheter i ett
projektarbete? Vilka egenskaper bör du förstärka och vilka behöver
du bli bättre på? Titta på listan av individuella frågor i början
av detta dokument.

- Hur fungerar du i ett team? Faller du in i ett särskilt mönster,
  eller tar du återkommande en särskild roll?
- Får du ut något av att jobba i en grupp, eller jobbar du helst
  ensam?
- Jämför hur mycket du lärt dig under projektarbetet kontra
  kursens övriga delar, och fundera över hur du bäst lär dig
  saker.
- Hur har det gått att logga arbetstid?
- "Biggest fail" och "biggest win", dvs. det största problem som
  du stötte på och det smartaste eller bästa du gjorde.

All individual reflections go into a file in =proj= called
=individual_reflections.md=.

This file should convince the examiner that each team member
passes Y67.


** Test Report

In the file =proj/test_report.md=, explain how you are testing
your project on three levels:
- Unit testing
- Integration testing
- Regression testing
And how you have automated these things. Include a graphical
overview of the code coverage. List your 6 most nasty bugs by
linking to their issue pages on GitHub.

This file, together with the GitHub issue log, should convince the
examiner that you pass Y69.

** Code Quality Report

In the file =./proj/code_quality_report.md=, your job is to
convince the examiner that the code passes Y65. You can go about
this in any way that you like that is helpful to the reviewer.
Helpful /saves time/, meaning that blanket statements such as
"just look at all the code" are not good enough[fn::Discussing
each function individually also would not save time...]. The
examiner wants to know to that /you think you have written good
code/ and /why you think that the code is good/!

Note that Y65 requires /consistently good quality/ meaning that
you cannot concentrate on code quality in just a few places, point
to them as good examples in the report, and expect to pass.


** Deviations

In =./proj/deviations.md=, describe all deviations from the full
specification. For every feature /X/ that you do not deliver,
explain /why/ you do not deliver it, how the feature could be
integrated in the future in your system, and sketch the high-level
design.

* Process Requirements

You can use whatever process you like, as long as you pick one and
stick to it. Recommendations are to follow some agile methodology
like Scrum or Kanban, but I'm fine with you trying to bite off the
Rationale Unified Process or doing a bad old waterfall. You don't
have time to learn a complicated process, so quickly pick
something that you can grasp fast. There is no right choice --
whatever you pick, it will form the basis for your more mature
understanding later.


** Trello (or similar)

You are required to use [[http://trello.com][Trello]] to manage tasks -- unless you find
a better tool. You get to define what better means, and that means
/in writing/ in the final project report. Do invite your coach to
your Trello board.

