projects/projects.html

<div id="outline-container-org52baa2e" class="outline-3">
<h3 id="org52baa2e"><span class="section-number-3">4.2</span> The Tests</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Unit tests, integration tests, etc. are placed in <code>./test</code>. It
should be possible to run these with <code>make test</code> and <code>make memtest</code> with the top-level makefile.
</p>
</div>
</div>

<div id="outline-container-org339028e" class="outline-3">
<h3 id="org339028e"><span class="section-number-3">4.3</span> Integrations with Existing Code</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Both projects ask for integration with existing code. Such code
should be placed in <code>./demo</code>. The top-level makefile should allow
building this code and link it with the code in <code>./src</code>.
</p>
</div>
</div>

<div id="outline-container-orgba2f41a" class="outline-3">
<h3 id="orgba2f41a"><span class="section-number-3">4.4</span> Design Documentation</h3>
<div class="outline-text-3" id="text-4-4">
<p>
In the file <code>./doc/design.md</code>, describe the design of the system at
a high level. You must start with a high-level description using
some graphical notation and accompanying text. The purpose of this
document is to serve as a starting point for someone that wants to
understand the implementation.
</p>

<p>
This file, together with <code>./proj/deviations.md</code> (and, naturally the
code) will be used by the examiner to convince him/herself that
you pass Y68.
</p>
</div>
</div>


<div id="outline-container-org5d6e090" class="outline-3">
<h3 id="org5d6e090"><span class="section-number-3">4.5</span> Team Retrospective</h3>
<div class="outline-text-3" id="text-4-5">
<p>
In a relatively short text write a team retrospective in which you
reflect on how the team has worked together. <b><b>A report template
<a href="project-report.html">is found here</a>.</b></b> Using this template, you will be asked to reflect
on the questions listed at the top of this document, but also
about:
</p>

<ul class="org-ul">
<li>The communication between team members and with people outside the team</li>
<li>The cooperation between team members</li>
<li>The coordination between team members with respect to technical tasks</li>
<li>How the programming tasks were divided, distributed, carried
out, load-balanced, etc. &#x2013; if you used pair programming how did
that go? Did you use it for everything?</li>
<li>How did you go about planning? Were your plans mostly followed?</li>
<li>How did decision making happen?</li>
<li>What process did you follow, why and how did that go?</li>
<li>What are they key lessons learned? (Both negative and positive!)</li>
</ul>

<p>
In a separate section of this document, diskutera arbetet med pull
requests (PRs) och löpande granskning av kod som går in i
''master''. Vad ledde detta till? Var det endast merarbete eller
tjänade det något till? Hur fungerade färgglada diffar på GitHub
som stöd för att se vad som ändrats? Hur ofta knuffades en PR
tillbaka för förändringar (eller liknande) innan den fick
merge:as? Hur många PR gjordes? Låg de länge i snitt? Arbetade
alla par lika med PR? Vad fungerade? Vad fungerade inte?
</p>

<p>
Sammanställ också samtliga gruppmedlemmars tidsloggar och ta fram
en gemensam sammanställning av tidsåtgång och fördelning över
olika kategorier<sup><a id="fnr.9" class="footref" href="#fn.9">9</a></sup>. Denna skall
visualiseras som ett pie chart.
</p>

<p>
The team retrospective goes into a file in <code>proj</code> called
<code>team_reflection.md</code>.
</p>

<p>
This file should convince the examiner that you pass Y64.
The text on pull requests, together with the actual pull request
log on GitHub, should convince the examiner that you pass Y66.
</p>
</div>
</div>

<div id="outline-container-orgbcc8f14" class="outline-3">
<h3 id="orgbcc8f14"><span class="section-number-3">4.6</span> Individual Reflection</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Varje projektmedlem skall skriva en kort självreflektion<sup><a id="fnr.10" class="footref" href="#fn.10">10</a></sup> om sin
prestation. Vilka är dina styrkor och svagheter i ett
projektarbete? Vilka egenskaper bör du förstärka och vilka behöver
du bli bättre på? Titta på listan av individuella frågor i början
av detta dokument.
</p>

<ul class="org-ul">
<li>Hur fungerar du i ett team? Faller du in i ett särskilt mönster,
eller tar du återkommande en särskild roll?</li>
<li>Får du ut något av att jobba i en grupp, eller jobbar du helst
ensam?</li>
<li>Jämför hur mycket du lärt dig under projektarbetet kontra
kursens övriga delar, och fundera över hur du bäst lär dig
saker.</li>
<li>Hur har det gått att logga arbetstid?</li>
<li>"Biggest fail" och "biggest win", dvs. det största problem som
du stötte på och det smartaste eller bästa du gjorde.</li>
</ul>

<p>
All individual reflections go into a file in <code>proj</code> called
<code>individual_reflections.md</code>.
</p>

<p>
This file should convince the examiner that each team member
passes Y67.
</p>
</div>
</div>


<div id="outline-container-org11bfcb7" class="outline-3">
<h3 id="org11bfcb7"><span class="section-number-3">4.7</span> Test Report</h3>
<div class="outline-text-3" id="text-4-7">
<p>
In the file <code>proj/test_report.md</code>, explain how you are testing
your project on three levels:
</p>
<ul class="org-ul">
<li>Unit testing</li>
<li>Integration testing</li>
<li>Regression testing</li>
</ul>
<p>
And how you have automated these things. Include a graphical
overview of the code coverage. List your 6 most nasty bugs by
linking to their issue pages on GitHub.
</p>

<p>
This file, together with the GitHub issue log, should convince the
examiner that you pass Y69.
</p>
</div>
</div>

<div id="outline-container-org920b5f6" class="outline-3">
<h3 id="org920b5f6"><span class="section-number-3">4.8</span> Code Quality Report</h3>
<div class="outline-text-3" id="text-4-8">
<p>
In the file <code>./proj/code_quality_report.md</code>, your job is to
convince the examiner that the code passes Y65. You can go about
this in any way that you like that is helpful to the reviewer.
Helpful <i>saves time</i>, meaning that blanket statements such as
"just look at all the code" are not good enough<sup><a id="fnr.11" class="footref" href="#fn.11">11</a></sup>. The
examiner wants to know to that <i>you think you have written good
code</i> and <i>why you think that the code is good</i>!
</p>

<p>
Note that Y65 requires <i>consistently good quality</i> meaning that
you cannot concentrate on code quality in just a few places, point
to them as good examples in the report, and expect to pass.
</p>
</div>
</div>


<div id="outline-container-org073f4ed" class="outline-3">
<h3 id="org073f4ed"><span class="section-number-3">4.9</span> Deviations</h3>
<div class="outline-text-3" id="text-4-9">
<p>
In <code>./proj/deviations.md</code>, describe all deviations from the full
specification. For every feature <i>X</i> that you do not deliver,
explain <i>why</i> you do not deliver it, how the feature could be
integrated in the future in your system, and sketch the high-level
design.
</p>
</div>
</div>
</div>

<div id="outline-container-org827af9d" class="outline-2">
<h2 id="org827af9d"><span class="section-number-2">5</span> Process Requirements</h2>
<div class="outline-text-2" id="text-5">
<p>
You can use whatever process you like, as long as you pick one and
stick to it. Recommendations are to follow some agile methodology
like Scrum or Kanban, but I'm fine with you trying to bite off the
Rationale Unified Process or doing a bad old waterfall. You don't
have time to learn a complicated process, so quickly pick
something that you can grasp fast. There is no right choice &#x2013;
whatever you pick, it will form the basis for your more mature
understanding later.
</p>
</div>


<div id="outline-container-org026165c" class="outline-3">
<h3 id="org026165c"><span class="section-number-3">5.1</span> Trello (or similar)</h3>
<div class="outline-text-3" id="text-5-1">
<p>
You are required to use <a href="http://trello.com">Trello</a> to manage tasks &#x2013; unless you find
a better tool. You get to define what better means, and that means
<i>in writing</i> in the final project report. Do invite your coach to
your Trello board.
</p>
</div>
</div>
