projects/projects.org
** TODO GitHub for Version Control, Issue Tracking and Pull Requests

Under projektet skall ni använda er av [[http://github.com][GitHub]] för att
versionshantera koden. Ni kommer att få ett privat konto på
Github, som ni *måste* använda. Av uppenbara och fuskrelaterade
skäl får koden inte göras publik eller delas med andra utanför
teamet (undantaget coachen och kursledningen). Versionshistoriken
på Github visar om versionshantering använts på ett vettigt sätt.

Github har ett utmärkt stöd för [[https://guides.github.com/features/issues/][issue tracking]], d.v.s.
buggrapporter och diskussioner kring buggar som ni skall använda.
Spårbarhet är oerhört viktigt i systemutveckling, så använd en
issue tracker/bug tracker, även om alla sitter i samma rum!

All integration av kod med projektets /main branch/ skall ske via
så-kallade [[https://help.github.com/categories/collaborating-with-issues-and-pull-requests/][pull requests]], där någon ber om att få sina ändringar
merge:ade med projektet. I samband med varje pull request skall
någon form av granskning ske. Är koden bra nog för att integreras?
Har den test? Har den rimlig dokumentation? Är den förståelig? Har
författaren städat koden ordentligt? När koden väl är inne i
systemet är den svår att bli av med, så ta tillfället i akt att
skapa en projektkultur där endast /bra pull requests accepteras/.

*To be added:* Tipsa om att bygga en checklista för hur PRs skall gå till baserat på kodgranskningsprotokoll

** Tools for Making Good Code

- You are required to use ~valgrind~ to check for memory errors.
  You will be asked to run e.g. ~make memtest~ at the final
  seminar and show the absence of error for a non-trivial program.
- You are required to write unit tests in some existing unit test
  framework, like CUnit. You will be asked to run e.g. ~make test~
  at the final seminar to show automated tests running. In
  combination with running ~make test~, you will also be asked to
  provide /test coverage metrics/ using e.g. [[https://gcc.gnu.org/onlinedocs/gcc/Gcov.html][gcov]], and reason
  about good your tests are. Automating this process is a good
  idea!
- Code formatting tools (not a strict requirement). Please use a
  code formatting tool like ~astyle~ or similar to ensure that
  code formatting is consistent.

* Final Seminar

Note: Obligatorisk närvaro / attending the seminar is mandatory.

The final seminars are divided intro several slots. Historically,
each slot is 90 minutes, but it may vary with the number of
students taking the course, the availability of examiners etc.

/Each group will participate in one slot only./ Each group is
expected to present their project. This is expected to take 25-30
minutes. An additional 30 mimnutes per slot is reserved for
questions, feedback and general discussion.

The presentation should touch on the following:

1) The program
   - What is implemented and not?
   - What works and what does not work?
   - Show your tests and demonstrate running the tests
   - If possible/applicable: run performance tests
   - If possible: show the running demonstrator application (typically lagerhanterare 2)
   - What simplifications did you do?
   - How did you set the cascade limit and to what?
   - How did you tackle hard problems?
   - What are you most satisfied about your implementation?
   - What is the ugliest hack in your implementation?
2) The process
   - How did you organise your work?
   - How has working together worked out?
   - What is the experience from working with pull requests?
   - How did you solve soft problems (e.g., key person fell ill, etc.)
   - How much time did it all take and how was it distributed?
   - Has logging time worked out well? Why/why not? Experiences?
3) Planning
   - How did you approach planning?
   - Did your plans work out?
   - How did you handled wrong planning?
4) Show the plan for the implementation of all that is missing
   - Based on your time log so far, estimate how much time that would take to do

The presentation is not a role-playing game, so don't pretend that
there is an audience that does not know what the project is etc.

** Do we need slides?

Jag fick frågan om man borde/måste ha en powerpoint-presentation på seminariet.

Måste: nej.
Borde: definitivt.

Det är svårt att strukturera en presentation (det borde vara uppenbart för alla som
sett mig föreläsa 100 gånger under kursen...) och en powerpoint -- speciellt en som
man har kört igenom 1-2 gånger i förväg -- tenderar att göra presentationen 10x
bättre. Det är lätt att visa visualiseringar, kod i läsbar och stor font, etc.

Det är ert seminarium så ni får göra som ni vill men det är bra
att använda tiden väl till att berätta om allt viktigt som kanske
inte står att läsa/går att utläsa ur inlämningen.

Tänk så här: jag vill att ni skall bli godkända! Jag kommer att leta efter bevis på
att ni har fått ut tillräckligt mycket av det jag vill att ni skall få ut av projektet,
och har ni det så blir ni godkända (om bara det ni levererar inte är helt otjänligt).

Om allt har kraschat och brunnit i slutet: ägna inte nätterna till att släcka bränder,
utan titta noga på det som kraschar och brinner och försök att hitta lärdomen i det.
Målet är inte att bevisa för någon att ni redan kan detta -- målet är att ni skall möta
svårigheterna och problemen med mjukvaruutveckling i grupp i en miljö där kostnaden för
att allt kraschar och brinner är låg.

Minns min långa rant om hållbarhet. Om ni är vakna 72 timmar i sträck för att släcka
bränder, hur skall ni då orka med nya kursstarter? Då kommer en liten rest på en liten
del av dokumentationen att kännas oöverstiglig.

Och ni kommer inte orka gå på kurspuben eller sista föreläsningen.

Det betyder alltså att även om ni definitivt borde ha en powerpoint men inte har det
så kanske det är bäst ändå att inte ha någon. Beroende på allt annat.

Hur lång är en projektrapport? Hur långt är ett snöre? Aaah!

Puh. Vi ses på seminarierna!

* Nutshell Summaries of the two Projects

#+begin_note
Note that the project specifications are subject to change at any moment.
#+end_note

If nothing else is stated, then the projects are required to work
on Linux X86 64 bit, Ubuntu 16.04 (which is what the department
provides). Note that developing on Windows or macOS and deploying
on Linux is very very brittle in C. In those cases, use a virtual
Linux environment for testing.

** Project One

Implement a simple system that helps programmers manage memory in
C applications using a /reference counting scheme/ where reference
counts are managed /manually/ through an API[fn::A fancy word for
library, if you will.] that you provide. This project involves
(among other things) wrapping ~malloc()~ to install an object
header in each memory allocation, which is hidden from users,
which stores a reference count for that object, and possibly other
things.

The full project description is [[file:project1.org][here]].

