projects/projects.html

<div id="outline-container-orga0b8758" class="outline-3">
<h3 id="orga0b8758"><span class="section-number-3">5.2</span> GitHub for Version Control, Issue Tracking and Pull Requests</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Under projektet skall ni använda er av <a href="http://github.com">GitHub</a> för att
versionshantera koden. Ni kommer att få ett privat konto på
Github, som ni <b>måste</b> använda. Av uppenbara och fuskrelaterade
skäl får koden inte göras publik eller delas med andra utanför
teamet (undantaget coachen och kursledningen). Versionshistoriken
på Github visar om versionshantering använts på ett vettigt sätt.
</p>

<p>
Github har ett utmärkt stöd för <a href="https://guides.github.com/features/issues/">issue tracking</a>, d.v.s.
buggrapporter och diskussioner kring buggar som ni skall använda.
Spårbarhet är oerhört viktigt i systemutveckling, så använd en
issue tracker/bug tracker, även om alla sitter i samma rum!
</p>

<p>
All integration av kod med projektets <i>main branch</i> skall ske via
så-kallade <a href="https://help.github.com/categories/collaborating-with-issues-and-pull-requests/">pull requests</a>, där någon ber om att få sina ändringar
merge:ade med projektet. I samband med varje pull request skall
någon form av granskning ske. Är koden bra nog för att integreras?
Har den test? Har den rimlig dokumentation? Är den förståelig? Har
författaren städat koden ordentligt? När koden väl är inne i
systemet är den svår att bli av med, så ta tillfället i akt att
skapa en projektkultur där endast <i>bra pull requests accepteras</i>.
</p>

<p>
<b><b>TODO</b></b>
</p>

<ul class="org-ul">
<li>Tipsa om att bygga en checklista för hur PRs skall gå till baserat på kodgranskningsprotokoll</li>
</ul>
</div>
</div>

<div id="outline-container-orgd5d62a6" class="outline-3">
<h3 id="orgd5d62a6"><span class="section-number-3">5.3</span> Tools for Making Good Code</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>You are required to use <code>valgrind</code> to check for memory errors.
You will be asked to run e.g. <code>make memtest</code> at the final
seminar and show the absence of error for a non-trivial program.</li>
<li>You are required to write unit tests in some existing unit test
framework, like CUnit. You will be asked to run e.g. <code>make test</code>
at the final seminar to show automated tests running. In
combination with running <code>make test</code>, you will also be asked to
provide <i>test coverage metrics</i> using e.g. <a href="https://gcc.gnu.org/onlinedocs/gcc/Gcov.html">gcov</a>, and reason
about good your tests are. Automating this process is a good
idea!</li>
<li>Code formatting tools (not a strict requirement). Please use a
code formatting tool like <code>astyle</code> or similar to ensure that
code formatting is consistent.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga20e0c5" class="outline-2">
<h2 id="orga20e0c5"><span class="section-number-2">6</span> Final Seminar</h2>
<div class="outline-text-2" id="text-6">
<p>
Note: Obligatorisk närvaro / attending the seminar is mandatory.
</p>

<p>
The final seminars are divided intro several slots. Historically,
each slot is 90 minutes, but it may vary with the number of
students taking the course, the availability of examiners etc.
</p>

<p>
<i>Each group will participate in one slot only.</i> Each group is
expected to present their project. This is expected to take 25-30
minutes. An additional 30 mimnutes per slot is reserved for
questions, feedback and general discussion.
</p>

<p>
The presentation should touch on the following:
</p>

<ol class="org-ol">
<li>The program
<ul class="org-ul">
<li>What is implemented and not?</li>
<li>What works and what does not work?</li>
<li>Show your tests and demonstrate running the tests</li>
<li>If possible/applicable: run performance tests</li>
<li>If possible: show the running demonstrator application (typically lagerhanterare 2)</li>
<li>What simplifications did you do?</li>
<li>How did you set the cascade limit and to what?</li>
<li>How did you tackle hard problems?</li>
<li>What are you most satisfied about your implementation?</li>
<li>What is the ugliest hack in your implementation?</li>
</ul></li>
<li>The process
<ul class="org-ul">
<li>How did you organise your work?</li>
<li>How has working together worked out?</li>
<li>What is the experience from working with pull requests?</li>
<li>How did you solve soft problems (e.g., key person fell ill, etc.)</li>
<li>How much time did it all take and how was it distributed?</li>
<li>Has logging time worked out well? Why/why not? Experiences?</li>
</ul></li>
<li>Planning
<ul class="org-ul">
<li>How did you approach planning?</li>
<li>Did your plans work out?</li>
<li>How did you handled wrong planning?</li>
</ul></li>
<li>Show the plan for the implementation of all that is missing
<ul class="org-ul">
<li>Based on your time log so far, estimate how much time that would take to do</li>
</ul></li>
</ol>

<p>
The presentation is not a role-playing game, so don't pretend that
there is an audience that does not know what the project is etc.
</p>
</div>

<div id="outline-container-org7ea3f5e" class="outline-3">
<h3 id="org7ea3f5e"><span class="section-number-3">6.1</span> Do we need slides?</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Jag fick frågan om man borde/måste ha en powerpoint-presentation på seminariet.
</p>

<p>
Måste: nej.
Borde: definitivt.
</p>

<p>
Det är svårt att strukturera en presentation (det borde vara uppenbart för alla som
sett mig föreläsa 100 gånger under kursen&#x2026;) och en powerpoint &#x2013; speciellt en som
man har kört igenom 1-2 gånger i förväg &#x2013; tenderar att göra presentationen 10x
bättre. Det är lätt att visa visualiseringar, kod i läsbar och stor font, etc.
</p>

<p>
Det är ert seminarium så ni får göra som ni vill men det är bra
att använda tiden väl till att berätta om allt viktigt som kanske
inte står att läsa/går att utläsa ur inlämningen.
</p>

<p>
Tänk så här: jag vill att ni skall bli godkända! Jag kommer att leta efter bevis på
att ni har fått ut tillräckligt mycket av det jag vill att ni skall få ut av projektet,
och har ni det så blir ni godkända (om bara det ni levererar inte är helt otjänligt).
</p>

<p>
Om allt har kraschat och brunnit i slutet: ägna inte nätterna till att släcka bränder,
utan titta noga på det som kraschar och brinner och försök att hitta lärdomen i det.
Målet är inte att bevisa för någon att ni redan kan detta &#x2013; målet är att ni skall möta
svårigheterna och problemen med mjukvaruutveckling i grupp i en miljö där kostnaden för
att allt kraschar och brinner är låg.
</p>

<p>
Minns min långa rant om hållbarhet. Om ni är vakna 72 timmar i sträck för att släcka
bränder, hur skall ni då orka med nya kursstarter? Då kommer en liten rest på en liten
del av dokumentationen att kännas oöverstiglig.
</p>

<p>
Och ni kommer inte orka gå på kurspuben eller sista föreläsningen.
</p>

<p>
Det betyder alltså att även om ni definitivt borde ha en powerpoint men inte har det
så kanske det är bäst ändå att inte ha någon. Beroende på allt annat.
</p>

<p>
Hur lång är en projektrapport? Hur långt är ett snöre? Aaah!
</p>

<p>
Puh. Vi ses på seminarierna!
</p>
</div>
</div>
</div>

<div id="outline-container-org6ffef03" class="outline-2">
<h2 id="org6ffef03"><span class="section-number-2">7</span> Nutshell Summaries of the two Projects</h2>
<div class="outline-text-2" id="text-7">
<div class="note">
<p>
Note that the project specifications are subject to change at any moment.
</p>

</div>

<p>
If nothing else is stated, then the projects are required to work
on Linux X86 64 bit, Ubuntu 16.04 (which is what the department
provides). Note that developing on Windows or macOS and deploying
on Linux is very very brittle in C. In those cases, use a virtual
Linux environment for testing.
</p>
</div>

<div id="outline-container-org9831b30" class="outline-3">
<h3 id="org9831b30"><span class="section-number-3">7.1</span> Project One</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Implement a simple system that helps programmers manage memory in
C applications using a <i>reference counting scheme</i> where reference
counts are managed <i>manually</i> through an API<sup><a id="fnr.12" class="footref" href="#fn.12">12</a></sup> that you provide. This project involves
(among other things) wrapping <code>malloc()</code> to install an object
header in each memory allocation, which is hidden from users,
which stores a reference count for that object, and possibly other
things.
</p>

<p>
The full project description is <a href="project1.html">here</a>.
</p>
</div>
</div>
